//
//  Document.swift
//  SlideshowApp01
//
//  Created by 株式会社コアファイン on 2016/02/25.
//  Copyright © 2016年 eiichi.takamura. All rights reserved.
//

//import Foundation



/****

課題：スライドショーアプリ

3つのボタン（進む、戻る、再生/停止）を使って、3つ以上の画像を順に自動送りで表示する
スライドショーアプリを作成してください。

下記の要件を満たしてください。

プロジェクトを新規作成し、 SlideshowApp というプロジェクト名をつけてください
画面を2つ作成してください
1つ目の画面ではスライドショー, 2つ目の画面では拡大画像を表示します
...........
◉スライドショー画面には、画像と3つのボタン（進む、戻る、再生/停止）を配置してください
◉進むボタンで1つ先の画像を表示し、戻るボタンで1つ前の画像を表示します
◉最後の画像の表示時に、進むボタンをタップすると、最初の画像が表示されるようにしてください
◉最初の画像の表示時に、戻るボタンをタップすると、最後の画像が表示されるようにしてください
...........
◉再生ボタンをタップすると自動送りが始まり、2秒毎にスライドさせてください
◉自動送りの間は、進むボタンと戻るボタンはタップ不可にしてください
◉再生ボタンをタップすると停止ボタンになり、停止ボタンをタップすると再生ボタンにしてください
◉停止ボタンをタップすると自動送りが止まり、進むボタンと戻るボタンをタップ可能にしてください
...........
○画像をタップすると画面を遷移させ、拡大画像と戻るボタンを表示させてください
◉戻るボタンがタップされると、スライドショー画面に戻り、同じ画像を表示してください

◉Auto Layoutを使用して、iPhone5, 6s, 6s plusの画面サイズでレイアウトが崩れないようにしてください
◉画像は、Xcodeのナビゲーションエリア（Project Navigator）へドラッグアンドドロップし、Copy items if neededにチェックを入れてCreate groups を選択し、Xcodeプロジェクトへコピーしてください
要件を満たすものであれば、どのようなものでも構いません。 見栄え良く、楽しめるスライドショーアプリを目指しましょう！

注意

画像やタイマーについてレッスンでは扱っていません。 Xcodeの探検やGoogle検索、リファレンスなどを駆使して自ら調査し実装する力を身に着けていきましょう。 まずは自分で探してみて、どうしてもわからない場合はメンターにヒントをもらいましょう。

****/